<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//FR">
<HTML>
<HEAD>
<TITLE>Remerciements</TITLE>
<META NAME="description" CONTENT="Remerciements">
<META NAME="keywords" CONTENT="recipro">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso_8859_1">
<LINK REL="STYLESHEET" HREF="recipro.css">
<LINK REL="next" HREF="node55.html">
<LINK REL="previous" HREF="node53.html">
<LINK REL="up" HREF="recipro.html">
<LINK REL="next" HREF="node55.html">
</HEAD>
<BODY >
<!--Navigation Panel-->
<A NAME="tex2html735" HREF="node55.html">
<IMG ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next_motif.gif"></A> 
<A NAME="tex2html732" HREF="recipro.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up_motif.gif"></A> 
<A NAME="tex2html726" HREF="node53.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="previous_motif.gif"></A> 
<A NAME="tex2html734" HREF="node1.html">
<IMG  ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents_motif.gif"></A>  
<B> Next:</B> <A NAME="tex2html736"
 HREF="node55.html">Bibliographie</A>
<B> Up:</B> <A NAME="tex2html733"
 HREF="recipro.html">R&#233;sidus quadratiques Lois de</A>
<B> Previous:</B> <A NAME="tex2html727"
 HREF="node53.html">Nanobiographies</A>
<!--End of Navigation Panel-->
<H1><A NAME="SECTION001200000000000000000">
Remerciements</A>
</H1>
<P>
Je tiens &#224; remercier ou &#224; saluer&nbsp;:
<BR>
- mes lecteurs, si j'en ai encore &#224; cette page. Mais j'ai pleinement 
conscience que de nombreux curieux commenceront par lire ces remerciements et 
je les incite donc &#224; consulter &#233;galement le restant de ce m&#233;moire
 (je ne rentrerai pas le d&#233;bat qui consiste &#224; savoir si le directeur de TER 
est &#224; incorporer dans la cat&#233;gorie ``lecteurs'')&nbsp;;
<BR>
- ceux dont j'admire le travail, tel Knuth qui met puis offre au monde T<SMALL>E</SMALL>X&nbsp;;
<BR>
- ceux dont j'admire les id&#233;aux, tel Zimmermann&nbsp;;
<BR>
- ceux dont j'admire les id&#233;es, tel Pomerance&nbsp;;
<BR>
- G&#233;rard Duchamp, professeur, pour ses encouragements &#224; me mettre au T<SMALL>E</SMALL>X 
et ses conseils&nbsp;;
<BR>
- Thierry Oger, ing&#233;nieur syst&#232;me, pour m'avoir facilit&#233; l'utilisation 
de L<SUP><SMALL>A</SMALL></SUP>T<SMALL>E</SMALL>X au laboratoire d'informatique de Rouen&nbsp;;
<BR>
- les gens du laboratoire de math&#233;matiques, qui m'ont permis de taper ce 
dossier&nbsp;;
<BR>
- les biblioth&#233;caires de la B.U. des sciences de Rouen, qui n'ont pas 
h&#233;sit&#233; &#224; s'enfoncer dans les m&#233;andres des vieux fonds pour mon bon 
plaisir&nbsp;;
<BR>
- Laurent Des&#233;challiers, pour m'avoir pr&#234;t&#233; les deux bouquins de Serre&nbsp;;
<BR>
- Claude Duvallet et Alexandre Pacini, pour m'avoir chacun imprim&#233; ce
 m&#233;moire&nbsp;;
<BR>
- les diverses imprimantes qui se sont &#233;vertu&#233;es &#224; ne faire pas leur travail&nbsp;;
<BR>
- Sandra Mat&#233;os, pour avoir d&#233;nigr&#233; mon mauvais <I>accent</I> et pour
 avoir tent&#233; de me faire introduire de l'<I>esprit</I>,
hell&#233;nisation qui a &#233;t&#233; pitoyablement sacrifi&#233;e sur l'autel de la 
texnologie&nbsp;;
<BR>
- Vincent Tilman, qui fut le premier d'une longue s&#233;rie &#224; &#234;tre 
horrifi&#233; par la densit&#233; de ma premi&#232;re mise en page. 
J'ai finalement suivi ces (ses)
 conseils, faisant de multiples efforts de pr&#233;sentation (si, si) malgr&#233; 
que j'en eusse, et c'est ainsi que le lecteur a entre ses mains un m&#233;moire 
bien plus lisible mais dont les imperfections subsistantes ne sauraient &#234;tre 
imput&#233;es &#224; mes conseillers&nbsp;;
<BR>
- tout quidam qui me signalerait, dans ce m&#233;moire, une faute typographique 
(qui ne soit toutefois pas le fruit d'un choix ostensiblement iconoclaste de 
l'auteur), orthographique (fors les transcriptions
du russe et du chinois qui, je le sais, laissent &#224; d&#233;sirer fortement),
grammaticale (non, je ne rejette pas les remarques des puristes et me tient
 &#224; leur enti&#232;re disposition),
historique, math&#233;matique (mais n'oublions point que, pour vulgariser, il 
faut savoir transiger, m&#234;me - surtout&nbsp;? - en math&#233;matique)
ou morale (voir n&#233;anmoins la remarque pr&#233;c&#233;dente)&nbsp;; <BR>
- mon directeur de TER, M. Legris, s'il a r&#233;sist&#233; aux bras de Morph&#233;e 
et s'il r&#233;siste &#224; ceux d'Anastasie...
<HR><ADDRESS>Auteur : <I>Cyril Banderier</I>, <I>23 juillet 1997</I>.</ADDRESS>
</BODY>
</HTML>
