<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr" >

   <head>
       <title>Lucas L&eacute;tocart - Page acad&eacute;mique</title>
       <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
       <link rel="stylesheet" media="screen" type="text/css" title="DesignJPOC" href="LIPN_gp.css" />
   </head>

   <body>
       <div id="en_tete"> <!-- debut de l'en-tete -->
            <table>
            <tr>
                <td><a href="http://www.univ-paris13.fr/"><img src="logoP13Petit.gif" alt="Logo Universit&eacute; Paris 13" /></a></td>
                <td><h1><a href="http://www-lipn.univ-paris13.fr/">LIPN</a> : <a href="http://www-lipn.univ-paris13.fr/AOC/">AOC</a></h1></td>
                <td><a href="http://www.cnrs.fr/"><img src="logoCNRS.jpg" alt="Logo CNRS" /></a></td>
            </tr>
            </table>
            <h1>Lucas L&eacute;tocart - Page Acad&eacute;mique</h1>
<table ><tr><td><img src="Photo_Lucas_Letocart_web.jpg" height="240" width="320" alt="Photo" /></td>
<td>
<i>Lucas L&eacute;tocart<br/>
Laboratoire d'Informatique de l'Universit&eacute; Paris Nord<br/>
Institut Galil&eacute;e<br/>
Avenue J.B. Cl&eacute;ment<br/>
93430 VILLETANEUSE<br/>

FRANCE<br/>
Tel 	: +33 1 49 40 40 84<br/>
Fax 	: +33 1 48 26 07 12<br/>
E-mail 	:lucas.letocart@lipn.univ-paris13.fr<br/><br/>
</i>
</td>
</tr>
</table>
<hr/>
       </div> <!-- fin de l'en-tete -->
 
       <div id="menu">
       <!-- Ici on mettra le menu -->
            <table> <!-- tableau contenant le menu -->
            <tr>
               <td><a href="index.html">Accueil</a></td>
               <td><a href="enseignement.html">Enseignement</a></td>
               <td><a href="recherche.html">Recherche</a></td>
               <td><a href="publications.html">Publications</a></td>
            </tr>
            </table>
            <hr/>
      </div>
 

       <div id="corps">
       <!-- Ici on mettra le contenu principal de la page (tout le texte quoi) -->
<BR>Je fais partie de l'&eacute;quipe <A HREF="http://www-lipn.univ-paris13.fr/equipes/AOC/">AOC (Algorithmes et Optimisation Combinatoire)</A> du <A HREF="http://www-lipn.univ-paris13.fr/">LIPN (Laboratoire d'Informatique de Paris Nord)</A>.
<!--<BR>Vous trouverez ici un descriptif de nos <A HREF="http://www-lipn.univ-paris13.fr/equipes/OCAD/index.html#ONE">activit&eacute;s</A>.-->
<BR>&nbsp;
<BR>
Mon domaine de recherche est l'optimisation combinatoire en nombres entiers, et
tout particuli&egrave;rement l'optimisation de probl&egrave;mes lin&eacute;aires et non lin&eacute;aires en 0-1 et/ou en nombres entiers.

<BR>&nbsp;
<BR>Mes travaux de recherche actuels concernent:
<BR><LI>les m&eacute;thodes de d&eacute;compositions et la r&eacute;optimisation pour la r&eacute;solution de programmes de grande taille (application: planification en transport, en &eacute;nergie et en sant&eacute;), en collaboration avec Roberto Wolfler Calvo (Professeur, LIPN - Universit&eacute; Paris 13), Laurent Alfandari (Professeur, LIPN - ESSEC), Sylvie Borne (Ma&icirc;tre de Conf&eacute;rences, LIPN - 
Universit&eacute; Paris 13), Fabio Furini (Post-Doctorant, LIPN - Universit&eacute; Paris 13), Paolo Gianessi (Doctorant, LIPN - Universit&eacute; Paris 13), Hanane Allaoua (Doctorante, LIPN - Universit&eacute; Paris 13) et Alberto Ceselli (Associated Professor, DTI, Univertita degli Studi di Milano, Italie);</LI>

<BR><LI>les relaxations et la convexification pour la r&eacute;solution de probl&egrave;mes quadratiques en variables binaires, en collaboration avec G&eacute;rard Plateau (Professeur &eacute;m&eacute;rite, LIPN - Universit&eacute; Paris 13) et Monique Guignard-Spielberg (Full Professor, DOIM - University of Pennsylvania, the Wharton School, USA);</LI>

<BR><LI>l'algorithmique de graphes pour la recherche de motifs bruit&eacute;s en bioinformatique, en collaboration avec C&eacute;line Rouveirol (Professeur, LIPN - Universit&eacute; Paris 13) et Karima Mouhoubi (Doctorante, LIPN - Universit&eacute; Paris 13.</LI>

<BR>Mes travaux de recherche ant&eacute;rieurs concernaient:
<BR><LI>les m&eacute;thodes de d&eacute;compositions, leur acc&eacute;l&eacute;ration et la r&eacute;optimisation pour la r&eacute;solution de programmes de grande taille (application: planification en transport), en collaboration avec Anass Nagih (Professeur, LITA - Universit&eacute; de Metz) et Nora Touati (Post-dosctorante, LIX - Ecole Polytechnique);</LI>

<BR><LI>la reformulation et l'introduction d'in&eacute;galit&eacute;s valides pour le probl&egrave;me du voyageur de commerce asym&eacute;trique avec contraintes de saut, en collaboration avec Laurent Alfandari (Professeur Associ&eacute;, LIPN - ESSEC), Sylvie Borne (Ma&icirc;tre de Conf&eacute;rences, LIPN - Universit&eacute; Paris 13) et Pierre Pesneau (Ma&icirc;tre de Conf&eacute;rences, IMB - Universit&eacute; de Bordeaux 1);</LI>

<BR><LI>la r&eacute;-optimisation en nombres entiers et la dualit&eacute; lagrangienne pour la r&eacute;solution du probl&egrave;me du sac &agrave; dos quadratique, en collaboration avec Anass Nagih et G&eacute;rard Plateau (Professeur, LIPN - Universit&eacute; Paris 13);</LI>

<BR><LI>les heuristiques duales, les relaxations (semi-d&eacute;finie, agr&eacute;g&eacute;e) et la convexification pour la r&eacute;solution du probl&egrave;me du sac &agrave; dos quadratique avec contrainte de cardinalit&eacute;, en collaboration avec G&eacute;rard Plateau et Marie-Christine Plateau (Ing&eacute;nieur de recherche, GDF-Suez);</LI>

<BR><LI>la recherche de reformulations automatiques, en collaboration avec Leo Liberti (Ma&icirc;tre de Conf&eacute;rences, LIX - Ecole Polytechnique), Sonia Cafieri (ENAC), Fr&eacute;d&eacute;ric Messine (Ma&icirc;tre de Conf&eacute;rences, IRIT - ENSEEIHT) et Marie-Christine Plateau dans le cadre d'un projet ANR Jeunes Chercheurs;</LI>

<BR><LI>l'algorithmique de graphes, pour le traitement d'images 2D, 3D et 4D, en collaboration avec Francois Malgouyres (Ma&icirc;tre de Conf&eacute;rences, LAGA - Universit&eacute; Paris 13), dans le cadre de la th&egrave;se de doctorat de Nicolas Lerm&eacute; (allocation de recherche 2008-2011).</LI>

<BR><LI>la complexit&eacute; des probl&egrave;mes de multiflots maximaux et de multicoupes minimales dans les structures particuli&egrave;res, 
tels que les arbres et les anneaux, et la d&eacute;termination d'algorithmes polynomiaux efficaces pour ces probl&egrave;mes dans de telles structures, en collaboration avec Marie-Christine Costa (Professeur, CEDRIC - CNAM), Fr&eacute;d&eacute;ric Roupin (Professeur, LIPN - 
Universit&eacute; Paris 13) et C&eacute;dric Bentz (Ma&icirc;tre de Conf&eacute;rences, LRI - Paris 11).

<BR>&nbsp;
<BR>&nbsp;
<BR>Voici une liste de quelques projets auquel je participe (ou ai particip&eacute;):

<BR><LI>GDF-SUEZ:
<BR>Participation &agrave; une prestation de conseil pour GDF-SUEZ en 2013;
<BR>Titre de la prestation: Optimisation des capacit&eacute;s d'un r&eacute;seau de transport de gaz;
<BR>Autre membre de l'&eacute;quipe: Fr&eacute;d&eacute;ric Roupin (Paris 13-LIPN), Roberto Wolfler Calvo (Paris 13-LIPN).
<BR>Partenaire industriel: GDF-SUEZ.</LI>

<BR><LI>Air Liquide:
<BR>Participation &agrave; un projet Air Liquide pour 2013-2014;
<BR>Titre du projet: Bulk distribution optimization within VMI industrial;
<BR>Autre membre de l'&eacute;quipe: Roberto Wolfler Calvo (Paris 13-LIPN).
<BR>Partenaire industriel: Air Liquide.</LI>

<BR><LI>BQR Universit&eacute; Paris 13: Projet interdisciplinaire:
<BR>Participation &agrave; un projet interdisciplinaire dans le cadre du Bonus Qualit&eacute; Recherche de l'Universit&eacute; Paris 13 pour l'ann&eacute;e 2012;
<BR>Titre du projet: M&eacute;thodes automatiques et adaptatives de segmentation pour la d&eacute;tection et le suivi de l'&eacute;volution de pathologies par analyse d'images m&eacute;dicales;
<BR>Autres membres de l'&eacute;quipe:Francoise Dibos (Paris 13-LAGA), Nicolas Lerm&eacute; (Paris 13-LAGA/LIPN), S&eacute;bastien Li-Thiao-t&eacute; (Paris 13-LAGA), Marie Luong (Paris 13-L2TI), Jean-Marie Rocchisani (Hopital Avicenne, UFR SMBH), Quang Tung Thieu (Paris 13-L2TI), Dinh Hoan Trinh (Paris 13-LAGA/L2TI), Emmanuel Viennet (Paris 13-L2TI).</LI>

<BR><LI>Google:
<BR>Participation &agrave; un projet Google Focused Grant Program on Mathematical Optimization and Combinatorial Optimization in Europe pour l'ann&eacute;e 2012;
<BR>Titre du projet: Reoptimization and Column Generation;
<BR>Autre membre de l'&eacute;quipe: Roberto Wolfler Calvo (Paris 13-LIPN).
<BR>Partenaire industriel: Google.</LI>

<BR><LI>ANR (Agence Nationale de la Recherche) Ville Durable:
<BR>Participation &agrave; un projet ANR Ville Durable pour une dur&eacute;e de trois ans de d&eacute;cembre 2010 &agrave; mai 2014;
<BR>titre du projet: Mutualisation et Optimisation de la Distribution Urbaine de Marchandises (MODUM);
<BR>Autres membres de l'&eacute;quipe: Nabil Absi (EMSE-ARMINES-CMP), <A HREF="http://www45.essec.fr/professorsCV/showCV.do?keyUrl=laurent-alfandari/"> Laurent Alfandari (ESSEC-LIPN)</A>, Christian Ambrosini (Lyon 2-LET), St&eacute;ephane Dauz&egrave;re-P&eacute;r&egrave;s (EMSE-ARMINES-CMP), Dominique Feillet (EMSE-ARMINES-CMP), Jesus Gonzales-Feliu (Lyon 2-LET), Fr&eacute;d&eacute;ric Meunier (ENPC-LVMT), Joelle Morana (Lyon 2-LET), Jean-Louis Routhier (Lyon 2-LET), Florence Toilier (Lyon 2-LET), <A HREF="http://www-lipn.univ-paris13.fr/~wolfler"> Roberto Wolfler Calvo (Paris 13-LIPN, responsable du projet)</A>.</LI>

<BR><LI>Projet Relations Internationales de l'Universit&eacute; Paris 13:
<BR>Participation &agrave; un projet Relations Internationales de l'Universit&eacute; Paris 13 pour l'ann&eacute;e 2010;
<BR>Titre du projet: Mod&egrave;les et algorithmes pour r&eacute;soudre les probl&egrave;mes de conception de r&eacute;seaux de distribution &agrave; deux niveaux;
<BR>Autres membres de l'&eacute;quipe: <A HREF="http://or.ingce.unibo.it/staff/roberto-baldacci/"> Roberto Baldacci (Universita di Bologna)</A>, <A HREF="http://www.lvmt.fr/spip.php?article247&var_recherche=chemla&lang=fr"> Daniel Chemla (Paris 13-LIPN et ENPC-LVMT)</A>, <A HREF="http://www3.csr.unibo.it/~maniezzo/"> Vittorio Maniezzo (Universita di Bologna)</A>, <A HREF="http://www.unibo.it/docenti/aristide.mingozzi"> Aristide Mingozzi (Universita di Bologna)</A>, Roberto Roberti (Universita di Bologna), <A HREF="http://www-lipn.univ-paris13.fr/~toulouse"> Sophie Toulouse (Paris 13-LIPN)</A>, <A HREF="http://www-lipn.univ-paris13.fr/~wolfler"> Roberto Wolfler Calvo (Paris 13-LIPN, responsable du projet)</A>.
<BR>Partenaire acad&eacute;mique: Universita di Bologna (Italie).</LI>

<BR>&nbsp;
<BR><LI>PEPS: Interactions Math&eacute;matiques-Informatique-Ing&eacute;nierie du CNRS:
<BR>Participation &agrave; un projet scientifique exploratoire dans le cadre des Projets Exploratoires PluridisciplinaireS du CNRS pour l'ann&eacute;e 2010;
<BR>Titre du projet: DisCut: Segmentation de tumeurs par graph-cuts distribu&eacute;s;
<BR>Autres membres de l'&eacute;quipe: <A HREF="http://www-lipn.univ-paris13.fr/~butelle/"> Franck Butelle (Paris 13-LIPN)</A>, <A HREF="http://www-lipn.univ-paris13.fr/~finta/"> Lucian Finta (Paris 13-LIPN)</A>, <A HREF="http://www.math.univ-paris13.fr/~malgouy/"> Francois Malgouyres (Paris 13-LAGA, responsable du projet)</A>, <A HREF="http://www-lipn.univ-paris13.fr/~lerme/"> Nicolas Lerm&eacute; (Paris 13-LAGA/LIPN)</A>, Jean-Marie Rocchisani (Paris 13-BTI).</LI>

<BR>&nbsp;
<BR><LI>BQR Universit&eacute; Paris 13: Projets scientifiques interdisciplinaires:
<BR>Participation &agrave; un projet scientifique interdisciplinaire dans le cadre du Bonus Qualit&eacute; Recherche de l'Universit&eacute; Paris 13 pour l'ann&eacute;e 2010;
<BR>Titre du projet: SinToSC: Segmentation 3d INteractive d'images TOmographiques: application au Suivi &eacute;volutif des Cancers pulmonaires par volum&eacute;trie tumorale;
<BR>Autres membres de l'&eacute;quipe: Camille Guillerminet (Paris 13-BTI), <A HREF="http://www.math.univ-paris13.fr/ann/indiv/?clef=DFT09ZLrfH"> Francoise Dibos (Paris 13-LAGA)</A>, <A HREF="http://www.math.univ-paris13.fr/~malgouy/"> Francois Malgouyres (Paris 13-LAGA, responsable du projet)</A>, Jean-Francois Mor&egrave;re(Paris 13-Oncologie), <A HREF="http://www-lipn.univ-paris13.fr/~lerme/"> Nicolas Lerm&eacute; (Paris 13-LAGA/LIPN)</A>, Jean-Marie Rocchisani (Paris 13-BTI).</LI>

<BR>&nbsp;
<BR><LI>Projet Relations Internationales de l'Universit&eacute; Paris 13:
<BR>Participation &agrave; un projet Relations Internationales de l'Universit&eacute; Paris 13 pour l'ann&eacute;e 2009;
<BR>Titre du projet: M&eacute;thodes et mod&egrave;les pour la r&eacute;solution exacte de nouveaux probl&egrave;mes complexes &eacute;mergeant dans le domaine de la logistique et du transport de marchandises;
<BR>Autres membres de l'&eacute;quipe: <A HREF="http://or.ingce.unibo.it/staff/roberto-baldacci/"> Roberto Baldacci (Universita di Bologna)</A>, <A HREF="http://www.cs.unibo.it/people/phd-students/ebartoli.html"> Enrico Bartolini (Universita di Bologna)</A>, <A HREF="http://www-lipn.univ-paris13.fr/~borne/"> Sylvie Borne (Paris 13-LIPN)</A>, <A HREF="http://www3.csr.unibo.it/~maniezzo/"> Vittorio Maniezzo (Universita di Bologna)</A>, <A HREF="http://www.unibo.it/docenti/aristide.mingozzi"> Aristide Mingozzi (Universita di Bologna)</A>, Roberto Roberti (Universita di Bologna), <A HREF="http://www-lipn.univ-paris13.fr/~toulouse"> Sophie Toulouse (Paris 13-LIPN)</A>,
<A HREF="http://www-lipn.univ-paris13.fr/~wolfler"> Roberto Wolfler Calvo (Paris 13-LIPN, responsable du projet)</A>.
<BR>Partenaire acad&eacute;mique: Universita di Bologna (Italie).</LI>

<BR>&nbsp;
<BR><LI>GDR Recherche Op&eacute;rationnelle du CNRS:
<BR>Porteur et participation &agrave; un projet du GDR RO pour l'ann&eacute;e 2009;
<BR>Titre du projet: Projections, heuristiques, relaxations et m&eacute;thodes de coupes pour le
probl&egrave;me du voyageur de commerce asym&eacute;trique avec contraintes de saut;
<BR>Autres membres de l'&eacute;quipe: <A HREF="http://www45.essec.fr/professorsCV/showCV.do?keyUrl=laurent-alfandari/"> Laurent Alfandari (ESSEC-LIPN)</A>, <A HREF="http://www-lipn.univ-paris13.fr/~borne/"> Sylvie Borne(Paris 13-LIPN)</A>, <A HREF="http://www.ufr-mi.u-bordeaux.fr/maths/?article43&uid=pesneau"> Pierre Pesneau(Bordeaux 1- IMB)</A>.
<BR>Partenaires acad&eacute;miques: ESSEC (Cergy), IMB (Bordeaux).</LI>

<BR>&nbsp;
<BR><LI>Projet LIPN:
<BR>Participation &agrave; un projet LIPN (Laboratoire d'Informatique de Paris Nord) pour l'ann&eacute;e 2009;
<BR>Titre du projet: Algorithmes de graphes pour la recherche de motifs fr&eacute;quents flous;
<BR>Autre membre de l'&eacute;quipe: <A HREF="http://www-lipn.univ-paris13.fr/~rouveirol/"> C&eacute;line Rouveirol (Paris 13-LIPN)</A>.</LI>

<BR>&nbsp;
<BR><LI>BQR Universit&eacute; Paris 13: Projet scientifique &eacute;mergeant:
<BR>Participation &agrave; un projet scientifique &eacute;mergeant dans le cadre du Bonus Qualit&eacute; Recherche de l'Universit&eacute; Paris 13 pour l'ann&eacute;e 2009;
<BR>Titre du projet: Etude crois&eacute;e des m&eacute;thodes d'optimisation combinatoire et de leurs applications en segmentation et recalage pour l'analyse et le traitement des images;
<BR>Autres membres de l'&eacute;quipe: <A HREF="http://www.math.univ-paris13.fr/ann/indiv/?clef=DFT09ZLrfH"> Francoise Dibos (Paris 13-LAGA)</A>, <A HREF="http://www.math.univ-paris13.fr/~malgouy/"> Francois Malgouyres (Paris 13-LAGA)</A> et <A HREF="http://www-l2ti.univ-paris13.fr/~mostafaoui"> Ghil&egrave;s Mostafaoui (Paris 13-L2TI)</A>.</LI>

<BR>&nbsp;
<BR><LI>SNCF Direction de l'Innovation et de la Recherche:
<BR>Participation &agrave; un contrat d'&eacute;tude et de veille technologique avec la Direction de l'Innovation et de la Recherche de la SNCF, janvier 2005 - d&eacute;cembre 2007.</LI>

<BR>&nbsp;
<BR><LI>Agence Nationale de la Recherche:
<BR>Participation &agrave; une ANR Jeunes Chercheuses et Jeunes Chercheurs pour une dur&eacute;e de trois ans d'octobre 2007 &agrave; septembre 2010;
<BR>Titre du projet: Automatic Reformulation Search;
<BR>Autres membres de l'&eacute;quipe: 
<A HREF="http://www.lix.polytechnique.fr/~liberti/"> Leo Liberti (Ecole Polytechnique-LIX, responsable du projet)</A>, <A HREF="http://messine.perso.enseeiht.fr/"> Fr&eacute;d&eacute;ric Messine (ENSEEIHT-IRIT)</A>, <A HREF="http://www.lix.polytechnique.fr/~cafieri/"> Sonia Cafieri (ENAC)</A>, Marie-Christine Plateau (GDF-Suez);
<BR> Partenaires acad&eacute;miques: Pierre Hansen (Montr&eacute;al-GERAD), Frank Plastria (Bruxelles-MOSI).</LI>

<BR>&nbsp;
<BR><LI>Minist&egrave;re de la recherche:
<BR>Participation &agrave; une ACI (Action Concert&eacute;e et Incitative) Jeunes Chercheurs du Minist&egrave;re de l'Education Nationale, de la Recherche et de la Technologie pour une dur&eacute;e de trois ans de septembre 2004 &agrave; ao&ucirc;t 2007;
<BR>Titre du projet: Planification et gestion optimis&eacute;e des ressources en transport: r&eacute;optimisation et hybridation de la g&eacute;n&eacute;ration de colonnes et des m&eacute;taheuristiques;
<BR>Autres membres de l'&eacute;quipe: <A HREF="http://www.lita.univ-metz.fr/annuaire.cgi?id=anasnagi">Anass Nagih (Metz-LITA, responsable du projet)</A>, <A HREF="http://www45.essec.fr/professorsCV/showCV.do?keyUrl=laurent-alfandari/">Laurent Alfandari (ESSEC-LIPN)</A>, <A HREF="http://cedric.cnam.fr/~aplateau/">Agn&egrave;s Plateau (CNAM-CEDRIC)</A> et <A HREF="http://www-lipn.univ-paris13.fr/~toulouse">Sophie Toulouse (Paris 13-LIPN)</A>;
<BR>Partenaire industriel: SNCF;
<BR>Partenaire acad&eacute;mique: GERAD (Canada).</LI>

<BR>&nbsp;
<BR>&nbsp;
<BR>Membre de <A HREF="http://lipn.univ-paris13.fr/~wolflercalvo/grefelot.html"> GREFELOT</A>, Groupe de Recherche Francilien sur l'Environnement, la Logistique et les Transports du point de vue de la Recherche Op&eacute;rationnelle.


<!--<BR>Un de mes axes de recherche est l'&eacute;tude de la r&eacute;-optimisation au sein d'un sch&eacute;ma de g&eacute;n&eacute;ration de colonnes. Je co-encadre, avec <A HREF="http://www-lipn.univ-paris13.fr/~nagih/">Anass Nagih</A>, la th&egrave;se de <A HREF="http://www-lipn.univ-paris13.fr/~touati/">Nora Touati</A> sur ce sujet.
<BR>Un autre axe de recherche est l'&eacute;tude des probl&egrave;mes lin&eacute;aires en nombres entiers, tels que les probl&egrave;mes de multiflot et multicoupe,
dans des structures particuli&egrave;res afin de d&eacute;terminer leur complexit&eacute; et donner, 
selon les cas, des algorithmes exacts ou approch&eacute;s pour leurs r&eacute;solutions. Cette recherche s'effectue en collaboration avec <A HREF="http://cedric.cnam.fr/~costa/">Marie-Christine Costa</A> et <A HREF="http://www.iie.cnam.fr/~roupin/">Fr&eacute;d&eacute;ric Roupin</A> du laboratoire <A HREF="http://cedric.cnam.fr/">CEDRIC</A> et <A HREF="http://www.lri.fr/~bentz/Bentz.php">C&eacute;dric Bentz</A> du laboratoire <A HREF="http://lri.fr/">LRI</A>.
<BR>Je travaille &eacute;galement sur la r&eacute;solution et la r&eacute;-optimisation de probl&egrave;mes quadratiques en 0-1 sous contraintes lin&eacute;aires, en collaboration avec <A HREF="http://www-lipn.univ-paris13.fr/~nagih/">Anass Nagih</A> et <A HREF="http://www-lipn.univ-paris13.fr/~plateau/">G&eacute;rard Plateau</A> d'une part, et en collaboration avec <A HREF="http://cedric.cnam.fr/~plateau/MCPlateau.html">Marie-Christine Plateau</A> et <A HREF="http://www-lipn.univ-paris13.fr/~plateau/">G&eacute;rard Plateau</A> d'autre part.
<BR>Un autre axe de recherche, avec <A HREF="http://www-lipn.univ-paris13.fr/~alfandari/">Laurent Alfandari</A> et <A HREF="http://www-lipn.univ-paris13.fr/~borne/">Sylvie Borne</A>, concerne l'&eacute;tude et la r&eacute;solution du probl&egrave;me du voyageur de commerce asym&eacute;trique.
<BR>Enfin, avec <A HREF="http://www.lix.polytechnique.fr/~liberti/">Leo Liberti</A>, <A HREF="http://messine.perso.enseeiht.fr/">Fr&eacute;d&eacute;ric Messine</A> et <A HREF="http://cedric.cnam.fr/~plateau/MCPlateau.html">Marie-Christine Plateau</A>, nous participons depuis octobre 2007 &agrave; un projet ANR Jeunes Chercheurs sur la recherche de reformulations automatiques.-->
&nbsp;


        </div>
       </div> 
       <div id="pied_de_page">
       <!-- Enfin, on mettra en bas de la page le nom de l'auteur, un copyright... -->
       </div>
   </body>
</html>



