<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="fr" >

   <head>
       <title>SupGalil&eacute;e - INFO3 - ADO</title>
       <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
       <link rel="stylesheet" media="screen" type="text/css" title="DesignINFO2" href="Info2.css" />
   </head>

   <body>
       <div id="en_tete">
       <!-- Ici on mettra la banni&egrave; re -->
<table>
<tr>
<td><a href="http://www.sup-galilee.univ-paris13.fr/"><img src="logoSupGalilee.jpg" alt="Logo SupGalil&eacute;e" /></a></td>
<td><img src="blanc.jpg" alt=" " /></td>
<td><a href="http://www.univ-paris13.fr/"><img src="logoup13.gif" alt="Logo Universit&eacute; Paris 13" /></a></td>
</tr>
</table>
<div>
<h1>Ing&eacute;nieurs Informatique 3&egrave;me ann&eacute;e<br/>
INFO3 - Option ADO</h1>
</div>
       </div>
 
       <div id="menu">
       <!-- Ici on mettra le menu -->

            <span class="element_menu"> <!-- Cadre correspondant &agrave;  un sous-menu -->
                   <a href="index.html">Accueil</a>
            </span>
 
 
       </div>
 
       <div id="corps">
       <!-- Ici on mettra le contenu principal de la page (tout le texte quoi) -->

          
<div>
           <h2>Apprentissage Symbolique Automatique</h2>     

<p>
C. Rouveirol, H. Soldano et Y. Chevaleyre (par ordre d'apparition)
</p>

<p>
Le but de ce cours est de pr&eacute;senter des techniques d'apprentissage  qui op&egrave;rent sur des langages d'hypoth&egrave;ses "symboliques", c'est-&agrave;-dire exprim&eacute;es dans des langages logiques (propositionnelle ou en ordre un).
</p>

<p>
<strong>Cours 1:</strong> Le premier cours introduit un algorithme d'apprentissage "historique", permettant e construire des Arbres de D&eacute;cision, &eacute;tant donn&eacute; un ensemble d'apprentissage form&eacute; d'exemples positifs et n&eacute;gatifs. Ce premiers cours permet d'introduire les premi&egrave;res d&eacute;finitions essentielles pour la suite du cours.
</p>

<p>
<strong>Cours 2:</strong> Ce deuxi&egrave;me cours introduit les deux notions fondamentales d'ordre partiel sur un espace d'hypoth&egrave;ses et d'espace des versions. Il pr&eacute;sent aussi un algorithme d'&eacute;limination des candidats de Mitchell et introduit la notion de biais (de langage et de recherche) en apprentissage et celle de l'apprentissage vu comme une recherche dans un espace d'hypoth&egrave;ses partiellement ordonn&eacute;.
</p>

<p>
<strong>Cours 3, 4 et 5:</strong> Les cours suivants (associ&eacute;s &agrave; deux TPs) permettent d'introduire et d'&eacute;tudier diverses strat&eacute;gies d'apprentissage de r&egrave;gles ainsi que les syst&egrave;mes les impl&eacute;mentant. On abordera &eacute;galement dans ces cours les notions d'&eacute;valuation des syst&egrave;mes d'apprentissage,  de sur-apprentissage et d'&eacute;lagage d'un ensemble de r&egrave;gles.
</p>

<p>
<strong>Cours 6  et 7:</strong> Aspects th&eacute;oriques de l'Apprentissage Artificiel. On aborde dans le cours les od&egrave;les d'apprentissage en ligne Mistake-bound et par requ&ecirc;tes, et l'apprentissage Probablement Approximativement Correct (PAC). Dans les deux cas on se pose des questions sur les ressources suffisantes pour garantir d'atteindre ou d'approcher une fonction bool&eacute;enne cible. Nous pr&eacute;senterons en particulier des mod&egrave;les d'algorithmes classiques dans le cas mistake-bound : le principe du Halving (litt&eacute;ralement division par deux) et l'algorithme Winnow.
</p>

<p>
<strong>Cours 8:</strong> Fouille de donn&eacute;es.  On s'attache dans cette partie &agrave; l'&eacute;tude d'une processus non supervis&eacute;, l'extraction de motifs ferm&eacute;s et de r&egrave;gles d'associations. Nous pr&eacute;senterons la notion de treillis de concepts, donnant une repr&eacute;sentation structur&eacute;e et compacte de l'ensemble des motifs qui se distinguent sur un ensemble d'objets, chaque noeud du treillis &eacute;tant associ&eacute; &agrave; une classe d'&eacute;quivalence de motifs et &agrave; son repr&eacute;sentant dit motif "ferm&eacute;". On d&eacute;duit classiquement de ces repr&eacute;sentations une base de l'ensemble des r&egrave;gles d'associations satisfaisant des crit&egrave;res de support et de confiance sur les objets d'entr&eacute;e. La construction du treillis et de la base de r&egrave;gle par l'algorithme Close est pr&eacute;sent&eacute;e.
</p>

<p>
<strong>Cours 9 et 10:</strong> Ces deux derniers cours aborderont deux points compl&eacute;mentaires : le mod&egrave;le d'apprentissage on-line, o&ugrave; les exemples, contrairement aux cas pr&eacute;c&eacute;dents, ne sont pas disponibles d&egrave;s le d&eacute;but de l'apprentissage, mais arrivent un &agrave; un au syst&egrave;me d'apprentissage. Ceci pose des probl&egrave;mes sp&eacute;cifiques aux syst&egrave;mes d'apprentissage supervis&eacute; (ordre des exemples, sensibilit&eacute; au bruit, etc.). Enfin, nous aborderons les mod&egrave;les de classification supervis&eacute;e par ensemble :  on cherche &agrave; optimiser la performance d'un classifieur binaire en combinant plusieurs instances de ce classifieur. Nous &eacute;tudierons en particulier les propri&eacute;t&eacute;s de l'algorithme de boosting, ce qui nous permettra de faire le lien avec le cadre PAC. 
</p>

</div>

<div>
<h2 id="Contacts">Contacts</h2>

Pour plus d'informations, vous pouvez contacter :<br/>

<p><a href="http://www-lipn.univ-paris13.fr/~rouveirol/">C&eacute;line Rouveirol</a></p>

<p><a href="http://www-lipn.univ-paris13.fr/~soldano/">Henry Soldano</a></p>

<p><a href="http://www-lipn.univ-paris13.fr/~chevaleyre/">Yann Chevaleyre</a></p>

</div>
       </div>
 
     <!--  <div id="pied_de_page"> -->
       <!-- Enfin, on mettra en bas de la page le nom de l'auteur, un copyright... -->
      <!-- </div> -->
   </body>
</html>




