<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
<TITLE>S&eacute;minaire LIFAR</TITLE>
</HEAD>
<BODY>
<CENTER>

<H2>S&eacute;minaire LIFAR</H2>
(Laboratoire d'Informatique Fondamentale et Appliqu&eacute;e de Rouen)<BR>
Jeudi 7 janvier 1999 &agrave; 14 heures.

<BR>
<H3>"Automates infinis : une approche combinatoire 
et analytique via les marches al&eacute;atoires"</H3>
Cyril Banderier, Projet Algorithmes, INRIA.
</CENTER>

<BR>
<U>
R&eacute;sum&eacute;</U> :

<P>
Les mots engendr&eacute;s par une grammaire avec un alphabet 
infini et un ensemble infini de productions
 peuvent &ecirc;tre vus comme les traces d'une marche dans un automate infini.
<P>
C'est un probl&egrave;me qui &eacute;quivaut &agrave; regarder les puissances it&eacute;r&eacute;es
d'une matrice ; c'est aussi, et c'est ce point de vue que nous retiendrons,
&eacute;quivalent &agrave; l'&eacute;tude de marches (al&eacute;atoires) sur un r&eacute;seau discret.
<P>
Nous nous int&eacute;resserons plus particuli&egrave;rement aux s&eacute;ries 
g&eacute;n&eacute;ratrices de ces  "marches al&eacute;atoires sur les entiers"
qui d&eacute;comptent les chemins de longueur n  (les mots de longueur n)
ou les excursions (les mots qui commencent et finissent par la m&ecirc;me lettre).
<P>
&Agrave; titre d'illustration, un cas bien connu est le langage de Dyck
qui peut &ecirc;tre vu comme une marche pour laquelle on part de (0) et on finit
en (0) en ne faisant que des pas +1 ou -1, tout en restant positif (la s&eacute;rie g&eacute;n&eacute;ratrice donne les
nombres de Catalan).
<P>
On donnera toute une classe de grammaires infinies donnant des
s&eacute;ries rationnelles, alg&eacute;briques ou transcendantes. Nous 
montrerons comment expliciter ces s&eacute;ries g&eacute;n&eacute;ratrices.
<P>
Nous illustrerons nos propos par quelques exemples ludiques :
<UL>
<LI>les Motzkin, les Dyck, une marche rationnelle sur les nombres premiers,
<LI>la r&eacute;solution de la conjecture de Pinzani sur les "arbres de
g&eacute;n&eacute;ration",
<LI>le probl&egrave;me du cavalier d'&eacute;checs, d&eacute;j&agrave; &eacute;tudi&eacute; via  
d'autres m&eacute;thodes par Labelle et Yeh, 
<LI>le lien avec les fractions continu&eacute;es, d&eacute;velopp&eacute;
dans un autre contexte par un article de Flajolet en 1980,
<LI>un probl&egrave;me ouvert de Petkovsek, sur une "g&eacute;n&eacute;ralisation du
triangle de Pascal".
</UL>
<P>
Si le temps ne nous fait pas d&eacute;faut, nous nous attaquerons &eacute;galement 
&agrave; des propri&eacute;t&eacute;s en moyenne et surtout 
&agrave; l'asymptotique du nombre de mots de longueur n.
L'inversion de Lagrange marche pour des &eacute;quations u=z phi(u),
nous devrons &eacute;tudier l'&eacute;quation plus g&eacute;n&eacute;rale  u^c=z phi(u),
ce qui se fait via la m&eacute;thode du point col.
<P>

La r&eacute;solution de la conjecture de Pinzani a fait l'objet d'un
article commun  (C. Banderier, M. Bousquet-Mélou, A. Denise, 
P. Flajolet, D. Gardy et D. Gouyou-Beauchamps).
<P>

<BR>Coordonn&eacute;es du conf&eacute;rencier :
<BR>Cyril Banderier 
<BR>Projet Algorithmes
<BR>INRIA Rocquencourt 
<BR>78153 Le Chesnay 
<P>
<A HREF="http://algo.inria.fr/banderier/">"http://algo.inria.fr/banderier/</a>
<BR>Cyril.Banderier <em>at</am> inria.fr 
</BODY>
</HTML>