<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html dir="ltr" xmlns="http://www.w3.org/1999/xhtml">

<!-- #BeginTemplate "master.dwt" -->

<head>
<meta content="text/html; charset=utf-8" http-equiv="Content-Type" />
<!-- #BeginEditable "doctitle" -->
<title>Conduite et gestion de projet - Ingénieurs informatique Sup'Galilée - 2014-2015</title>

<!-- #EndEditable -->
<link href="styles/style2.css" rel="stylesheet" type="text/css" />
</head>

<body>

<!-- Begin Container -->
<div id="container">
	<!-- Begin Masthead -->
	<div id="masthead">
		<h2 align="center">
		<a href="default.html" target="_blank">CGP 2014-2015</a></h2>
		<h3>Conduite et gestion de projet - Ingénieurs informatique Sup'Galilée - 2014-2015</h3>

		
	</div>
	<!-- End Masthead -->
	<!-- Begin Navigation -->
	<div id="navigation">
		<ul>
			<li><a href="default.html">Le Projet</a></li>
			<li><a href="projet/projet.htm">Projets & Groupes</a></li>
			<li><a href="calendrier/calendrier.htm">Calendrier 2014-2015</a></li>
			<li><a href="livrables/livrables.htm">Livrables</a></li>
			<li><a href="documentation/documentation.htm">Documentation & Supports</a></li>
		</ul>
		<p>&nbsp;</p>
		<p>&nbsp;</p>
		<p>&nbsp;</p>
		<p>&nbsp;</p>
	</div>
	<!-- End Navigation -->
	<!-- Begin Content -->
	

<div id="mainCGP" class="main">

<span>
<span>
    <h2>Appel à projets INFO2</h2>
    <!-- <h2>Conduite et gestion de projet - Ingénieurs informatique Sup'Galilée - 2013-2014</h2> -->
<hr/>

<p>

<div class="div1cgp">
<h3>Les projets en bref...</h3>

<p align="justify">
 Les projets offrent aux &eacute;tudiants l'opportunit&eacute; de&nbsp;:
<ul>
<li align="justify"> - participer &agrave; toutes les phases de r&eacute;alisation d'un projet informatique en adoptant un cadre m&eacute;thodologique&nbsp;;</li>
<li> - appr&eacute;hender le travail en &eacute;quipe (s'organiser entre eux)&nbsp;;</li>
<li align="justify"> - appr&eacute;hender le travail au sein d'une organisation (gestion de projet, relations ma&icirc;trise d'ouvrage, hi&eacute;rarchie,...)&nbsp;;</li>
<li> - mettre en application ce qu'ils ont vu en cours / rechercher des solutions &agrave; partir des exigences pos&eacute;es par le projet.</li>
</ul>

Une <span class="emph">&eacute;quipe de suivi</span> accompagne les &eacute;tudiants tout au long de la r&eacute;alisation des projets.
</p>

</div>

<div class="div2cgp">

<hr/>
<p>
<br>
<h3>Le projet</h3>

<p>

<p align="justify"><span class="emph">Sans aller dans des architectures trop complexes, il faut que le projet r&eacute;clame un minimum de technicit&eacute;. En effet, il s'agit essentiellement de confronter les &eacute;tudiants &agrave; une <span class="emph">d&eacute;marche de conception</span>, ainsi qu'aux probl&eacute;matiques li&eacute;es &agrave; <span class="emph">l'int&eacute;gration</span> (peu importe le fonctionnel, que celui-ci soit orient&eacute; ou non <q>recherche</q>). Il peut s'agir d'une application &agrave; monter de toute pi&egrave;ce comme d'une &eacute;volution, d'une migration, d'une interface (graphique, BD, application web... ),  d'un probl&egrave;me de conception pure (algorithmique - structures de donn&eacute;es),...&nbsp;: les projets de toute nature sont int&eacute;ressants.</p> 

<p align="justify">Le projet (difficult&eacute; technique, appr&eacute;hension du fonctionnel, envergure) peut &ecirc;tre assez cons&eacute;quent&nbsp;: les &eacute;quipes sont constitu&eacute;es de 4 ou 5 &eacute;tudiants qui disposent de plages r&eacute;serv&eacute;es au projet dans leur emploi du temps&nbsp;; cela donne un total de l'ordre de <span class="emph">100 jours/homme</span> par projet, ne vous censurez donc pas (d'autant que le comit&eacute; de pilotage est l&agrave; pour recadrer les objectifs en fonction des difficult&eacute;s pos&eacute;es par le projet ou rencontr&eacute;es par le groupe)&nbsp;!</p> 

Prenez tout de m&ecirc;me en consid&eacute;ration, pour les outils &agrave; mettre en oeuvre&nbsp;:
<ul>
<li>qu'il s'agit d'&eacute;tudiants qui sont en cours de leur ann&eacute;e INFO2 (pour vous faire une id&eacute;e plus pr&eacute;cise de leur potentiel, vous pouvez consulter la <a href="http://lipn.univ-paris13.fr/~toulouse/doc/SupGalilee_INFO/progression_info.pdf">progression des enseignements d'informatique</a> en ing&eacute;nieur)&nbsp;;</li>
<li>que ces outils doivent pouvoir &ecirc;tre mis &agrave; disposition des &eacute;tudiants.</li>
</ul>

<p align="justify"><span class="emph">Pas d'id&eacute;e&nbsp;?</span> Pensez &agrave; une brique logicielle d'un projet plus important, &agrave; un outil pour am&eacute;liorer votre quotidien (le projet peut concerner les services administratifs universitaires), &agrave; une nouvelle voie &agrave; explorer pour votre recherche,...&nbsp;?</p>
</p>



</p>

</div>
<hr/>
<div class="div2cgp">

<p>
<h3>Le client</h3>

<p>
<h4>Son r&ocirc;le</h4>
Votre r&ocirc;le, en tant que client, consiste en les points suivants&nbsp;:
<ul>
<li>proposer un projet et le pr&eacute;senter aux &eacute;tudiants&nbsp;;</li>

<li>participer aux r&eacute;unions du comit&eacute; de pilotage (ce qui implique, lire et r&eacute;agir aux documentations fournies)&nbsp;;</li>

<li>de mani&egrave;re g&eacute;n&eacute;rale, vous rendre disponible aupr&egrave;s des &eacute;tudiants (plus les interactions sont nombreuses, mieux le besoin sera cern&eacute; et, en cons&eacute;quence, r&eacute;alis&eacute;&nbsp;!).</li>
</ul>

<h4>Ses obligations</h4>
<span class="emph">R&eacute;unions du comit&eacute; de pilotage</span> votre pr&eacute;sence y est <span class="emph">indispensable</span>. 

<ul>
<li>Vous disposez d'environ <span class="emph">15 minutes</span> pour
pr&eacute;senter votre projet (apr&egrave;s-midi du mardi
28/10/2014).</li> <li>Chaque r&eacute;union du comit&eacute; de
pilotage dure <span class="emph">30 minutes</span> (apr&egrave;s-midi
des mardi 25/11/2014, 3/2/2015, 3/3/2015, 17/3/2015, 24/3/2015).</li>

<li>Pour la livraison finale, vous &ecirc;tes chaleureusement convi&eacute; &agrave; assister &agrave; <span class="emph">toutes les soutenances</span>.</li>
</ul>

<h4>Sa r&eacute;mun&eacute;ration</h4>

<p align="justify">
D'un point de vue comptable, le r&ocirc;le du client pour 1 projet est respectivement r&eacute;tribu&eacute; <span class="emph">8 et 12 heures (&eacute;quivalent TD) pour un client <q>acad&eacute;mique</q> et <q>industriel</q></span>.
</p>
</p>

</p>

</div>
<hr/>
<div class="div2cgp">

<p>
<h3>Soumettre un projet : mode d'emploi</h3>

<p>

Les propositions de projet doivent pr&eacute;senter le projet de fa&ccedil;on <span class="emph">succincte et pr&eacute;cise</span> (3 pages maximum), avec mention des informations&nbsp;:
<ul>
<li>titre&nbsp;;</li>
<li>objectifs du projet&nbsp;;</li>
<li>informations <q>administratives</q> (coordonn&eacute;es du client)&nbsp;;</li>
<li>contexte fonctionnel dans lequel il s'ins&egrave;re (ex.&nbsp;: dans le cadre d'un contrat, en faire le descriptif)&nbsp;;</li>
<li>environnement logiciel / mat&eacute;riel (SE, biblioth&egrave;ques, langage de programmation, SGBD etc... si la technologie est impos&eacute;e, description rapide de l'existant s'il s'agit de d&eacute;velopper un module &agrave; int&eacute;grer &agrave; un logiciel existant)&nbsp;;</li>
<li>les connaissances requises.</li>
</ul>

<p>Pour vous inspirer, vous pouvez consulter quelques <a href="http://perso.limsi.fr/hamon/CGP-20132014/AnciensSujets/">sujets des ann&eacute;es ant&eacute;rieures</a>.</p>
	
Vous pouvez m'envoyer vos propositions <span class="emph">par mail</span>, en tout format&nbsp;:
<blockquote>nistor.grozavu<q>at</q>lipn.univ-paris13.fr</blockquote>

<span class="emph">Date limite : </span> <span class="emph"> <strong>dimanche 26 octobre 2014&nbsp;!&nbsp;!&nbsp;! </strong></span>

</p>





<p>
Cette page est issue de la page préparée par <a
      href="http://lipn.univ-paris13.fr/~toulouse/projet.html">Sophie Toulouse</a> et par <a href="http://perso.limsi.fr/hamon/CGP-20132014/appel.php">Thierry Hamon</a>
</p>
</div>

    <hr/>            
	  <p>
	    <div id="update">
Dernière modification effectuée le 22/09/2014 
	    </div>
</p>           </div>  <!-- /margeur_contenu -->
        </div>  <!-- /division_contenu -->
    </div>  <!-- /division_cadre -->
</div>  <!-- /division_principale -->


	
</body>

<!-- #EndTemplate -->

</html>
