<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="Author" content="Jean-Yves Moyen">
   <title>Page professionnelle de Jean-Yves Moyen</title>
</head>
<body text="#000000" bgcolor="#FFFFCC" link="#0000FF" vlink="#FF0000"
alink="#000088">

<b>Titre : </b><i>Analyse de la complexit&eacute; et transformation
de programmes</i><br>

<p><b>R&eacute;sum&eacute; :</b></p>

<p>Le th&egrave;me de la th&egrave;se concerne l'analyse automatique
de la complexit&eacute; des programmes, en particulier en terme de
complexit&eacute; de la fonction calcul&eacute;e et non de
l'algorithme impl&eacute;ment&eacute;.</p>

<p>D'une part, la notion d'ordres de terminaison des syst&egrave;mes
de r&eacute;&eacute;criture est restreinte à l'aide de
quasi-interpr&eacute;tations, ce qui permet de donner une borne sur la
complexit&eacute; de la fonction calcul&eacute;e. Cette borne n'est
pas n&eacute;cessairement atteinte par le syst&egrave;me
&eacute;tudi&eacute; et il peut &ecirc;tre n&eacute;cessaire de
transformer le programme pour l'atteindre. Une caract&eacute;risation
de Ptime et une de Pspace sont ainsi obtenues.</p>

<p>D'autre part, un mini langage d'assemblage est &eacute;tudi&eacute;
au moyen de r&eacute;seaux de Petri. Il devient ainsi possible de
regrouper dans une seule analyse une preuve de terminaison proche du
``<i>Size-Change Principle</i>'', une preuve de calcul en place (sans
allouer de m&eacute;moire suppl&eacute;mentaire) et une simplification
du programme similaire à la d&eacute;forestation.  De plus, cette
technique permet de prouver la terminaison d'une tr&egrave;s grande
classe de programmes. En particulier, la terminaison d'algorithmes
comme celui d'Euclide ou comme les algorithmes ``<i>Diviser pour
r&eacute;gner</i>'' est obtenue de mani&egrave;re totalement
automatique.</p>

<b>Mots-cl&eacute;s :</b> Terminaison, complexit&eacute;,
r&eacute;&eacute;criture, r&eacute;seaux de Petri,
d&eacute;forestation.

</body>